const privacyPolicyContent = `
Версия: 20.02.2025 г.

В настоящей Политике конфиденциальности описаны правила обработки данных (в том числе персональных данных) пользователей сервиса «Паттайя Град», размещенного в сети Интернет по адресу «https://www.marquiz.ru/» (далее также – Сервис, Сервис «Паттайя Град»).

Оператор стремится обеспечивать максимальную конфиденциальность данных своих пользователей. Оператор будет использовать данные пользователей только в соответствии с положениями Политики конфиденциальности и Пользовательского соглашения сервиса «Паттайя Град».

Оператором ваших данных является: ООО «Марквиз», ИНН: 7722491826, ОГРН: 1207700342387, юридический адрес: г. Москва, вн.тер. г. Муниципальный округ Орехово-Борисово Северное, ул. Домодедовская, д. 4, помещ. 19п (далее – Оператор).

ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
Персональные данные - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).
Обработка персональных данных – обработка персональных данных - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
Оператор персональных данных - государственный орган, муниципальный орган, юридическое лицо или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
Обработчик персональных данных – лицо, осуществляющее обработку персональные данных в интересах и по поручению оператора персональных данных;
Сервис, Сервис «Паттайя Град» – программный комплекс, размещенный на сайте по адресу в сети Интернет «https://www.marquiz.ru/», позволяющий его пользователям создавать квизы для своих сайтов и сервисов.
Квиз – маркетинговые опросы, создаваемые для уточнения потребностей клиентов сайта Заказчика и ознакомления их с ассортиментом предлагаемым Заказчиком товаров, работ, услуг, а также для получения контактной информации клиентов, и размещаемые на сайте Заказчика.
Посетитель – лицо, посещающее сайт «Паттайя Град» без регистрации (создания учетной записи) в Сервисе.
Заказчик – зарегистрированный пользователь Сервиса «Паттайя Град», использующий Сервис для создания Квизов.
Сайт Заказчика – сайт в сети интернет, на котором Заказчик размещает квиз, созданный им посредством Сервиса «Паттайя Град».
Пользователь квиза – физическое лицо, использующее Квиз, созданный Заказчиком посредством Сервиса «Паттайя Град», и предоставляющее через Квиз свои данные.
1. ОБРАБАТЫВАЕМЫЕ ДАННЫЕ
При использовании Сервиса «Паттайя Град» Оператор может обрабатывать следующие данные:

1.1. при регистрации Заказчика (создании учётной записи) в Сервисе:

адрес электронной почты.
1.2. при заполнении Заказчиком личных данных в личном кабинете Сервиса:

имя
адрес электронной почты;
номер телефона;
Telegram ID;
должность.
1.3. при заполнении Квизов Пользователями Квизов – любые данные Пользователей Квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные, за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости; данных о банковских картах и иных платежных средствах.

1.4. при обработке файлов "cookies” и использовании аналогичных технологий:

IP-адрес;
файлы “cookies” и аналогичные технологии;
данные об использовании Пользователем Сервиса;
информация о местоположении подключения к Сервису.
2. ЦЕЛИ И УСЛОВИЯ ОБРАБОТКИ ДАННЫХ
2.1. Оператор обрабатывает данные в целях:

предоставления доступа к Сервису «Паттайя Град» и услугам Сервиса «Паттайя Град»;
оплаты Заказчиками услуг Сервиса «Паттайя Град»;
направления Заказчикам информационных сообщений о работе Сервиса «Паттайя Град»;
исполнения поручений Заказчиков на обработку персональных данных Пользователей Квизов (для случаев, когда Оператором персональных данных выступает Заказчик, а Оператор действует в качестве обработчика на основании поручения на обработку персональных данных);
обеспечения коммуникации и взаимодействия между Заказчиками и Пользователями Квизов, направления Пользователем Квизов информационных и рекламных сообщений, продвижения товаров, работ, услуг партнеров Оператора (Заказчиков);
проведение аналитических, маркетинговых, статистических и иных исследований использования Сервиса для оптимизации его работы, исправления ошибок и сбоев в работе Сервиса, развития продуктов и услуг Оператора и его партнеров.
2.2. Оператор может обрабатывать следующие данные в целях предоставления доступа к Сервису «Паттайя Град» и услугам Сервиса «Паттайя Град»:

IP-адрес;
субъекты (владелец) персональных данных: Заказчики;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: имя; адрес электронной почты; номер телефона; Telegram ID; должность;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента удаления учетной записи Заказчика в Сервисе.
2.3. Оператор может обрабатывать следующие данные в целях оплаты Заказчиками услуг Сервиса «Паттайя Град»:

субъекты (владелец) персональных данных: Заказчики;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: фамилия, имя;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента удаления учетной записи Заказчика в Сервисе.
2.4. Оператор может обрабатывать следующие данные в целях направления информационных сообщений о работе Сервиса «Паттайя Град»:

субъекты (владелец) персональных данных: Заказчики;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: фамилия, имя; адрес электронной почты;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента удаления учетной записи Заказчика в Сервисе.
2.5. Оператор может обрабатывать следующие данные в целях исполнения поручений Заказчика на обработку персональных данных Пользователей Квизов:

IP-адрес;
субъекты (владелец) персональных данных: Пользователи Квизов;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: любые данные Пользователей квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости;
Заказчикам запрещается создавать Квизы для сбора указанных выше биометрических и специальных персональных данных без получения письменных согласий на обработку данных, а Пользователям Квизов рекомендуется не предоставлять такие данные через Квизы без письменных согласий на обработку данных. В случае предоставления таких данных без письменных согласий просим сообщить об этом Оператору;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента предоставления согласия на обработку.
2.6. Оператор может обрабатывать следующие данные в целях обеспечения коммуникации и взаимодействия между Заказчиками и Пользователями Квизов, направления Пользователем Квизов информационных и рекламных сообщений, продвижения товаров, работ, услуг партнеров Оператора (Заказчиков):

субъекты (владелец) персональных данных: Пользователи Квизов;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: любые данные Пользователей Квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости;
Заказчикам запрещается создавать Квизы для сбора указанных выше биометрических и специальных персональных данных без получения письменных согласий на обработку данных, а Пользователям Квизов рекомендуется не предоставлять такие данные через Квизы без письменных согласий на обработку данных. В случае предоставления таких данных без письменных согласий просим сообщить об этом Оператору;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента предоставления согласия на обработку.
2.7. Оператор может обрабатывать следующие данные в целях проведения аналитических, маркетинговых, статистических и иных исследований использования Посетителями Сервиса для оптимизации его работы, исправления ошибок и сбоев в работе Сервиса, развития продуктов и услуг Оператора и его партнеров:

субъекты (владелец) персональных данных: Посетители, Заказчики, Пользователи Квизов;
категории обрабатываемых данных: иные;
перечень обрабатываемых данных: IP-адрес; файлы “cookies” и аналогичные технологии; данные об использовании Посетителем Сервиса; информация о местоположении подключения к Сервису;
срок обработки данных: до момента достижения целей обработки или отзыва согласия на обработку, но не более 3 (трех) лет с момента последнего посещения Сервиса.
2.8. Обработка данных осуществляется Оператором в автоматизированной форме и включает в себя: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (предоставление, доступ), блокирование, удаление, уничтожение персональных данных.

2.9. Порядок уничтожения данных: данные подлежат уничтожению в случаях:

достижения целей обработки;
истечения сроков обработки;
отзыва согласия на обработку;
реализации права на забвение;
предъявления уполномоченным государственным органом требования об уничтожении данных;
ликвидации или реорганизации Оператора.
Способ уничтожения: электронные массивы данных уничтожаются с помощью программных средств.

3. ФАЙЛЫ “COOKIES” И АНАЛОГИЧНЫЕ ТЕХНОЛОГИИ
Файлы “cookies” и аналогичные технологии (например, пиксели, тэги, кэш, локальное хранилище и т.п.) – это небольшие фрагменты данных чаще всего реализованные в виде текстовых файлов-идентификатор, которые устанавливаются на устройство или платформу подключения при посещении им интернет-ресурсов, отдельных страниц / модулей Сервиса, при взаимодействии с ними для получения и создания информации. В работе Сервиса используются файлы “cookies” различных видов, которые могут создаваться как самим Сервисом, так и третьими лицами - партнерами Оператора, предоставляющими, функционально-технические решения, необходимые для работы Сервиса.

Файлы “сookies” и аналогичные технологии позволяют:

1. посетителям, пользователям - персонализировать настройки работы с Сервисом,

2. Оператору - собирать данные, необходимые для оптимизации работы Сервиса, исправления ошибок и сбоев в его работе, развития продуктов и услуг Оператора и его партнеров.

Для этого Оператор сохраняет информацию о совершенных пользователями действиях в Сервисе, например, информацию об авторизации в личном кабинете, эффективности интерфейса на той или иной странице Сервиса, использовании или неиспользовании отдельных возможностей Сервиса и тому подобное.

Посетители / пользователи могут самостоятельно настроить параметры установки, блокировки, либо отказа от использования файлов “cookies”, в конфигурациях используемого им браузера либо устройства, через которое осуществляется доступ к Сервису. Информация о настройке установок, блокировке и удалении файлов “cookies” может быть найдена в справочных разделах браузера или устройства пользователя.

Удаление или запрет установки определенных файлов “cookies” может стать причиной невозможности использования отдельных функций Сервиса.

4. ОСНОВАНИЯ ОБРАБОТКИ ДАННЫХ
Оператор обрабатывает ваши данные, основываясь на:

необходимости исполнения Оператором обязанностей перед Пользователями Сайта, предусмотренных Пользовательским соглашением;
необходимости исполнения Оператором обязанностей перед Заказчиком, предусмотренных, поручением на обработку персональных данных (при наличии поручения);
предоставленном согласии на обработку данных;
законных интересах Оператора.
4.1. Исполнение обязанностей из Пользовательского соглашения

Оператор обрабатывает данные для исполнения своих обязанностей перед Заказчиками согласно условиям Пользовательского соглашения, в том числе для создания и использования личного кабинета в Сервисе, предоставления Заказчику доступа к Сервису «Паттайя Град» и получения услуг Сервиса «Паттайя Град», обеспечения коммуникации и взаимодействия между Заказчиками и Пользователями Квизов, направления Пользователем Квизов информационных и рекламных сообщений, продвижения товаров, работ, услуг партнеров Оператора (Заказчиков).

4.2. Согласие на обработку данных

4.2.1. Согласие Заказчика:

Перед регистрацией личного кабинета в Сервисе Заказчик предоставляет Оператору свое согласие на обработку ваших данных. Данное согласие является самостоятельным законным основанием для обработки данных. Заказчики предоставляют свое согласие на обработку ваших данных путем заполнения в Сервисе специальной формы о предоставлении согласия (чек-бокс).

При этом базовым основанием для обработки ваших данных является необходимость исполнения обязательств из Пользовательского соглашения Сервиса «Паттайя Град».

4.2.2. Согласия Пользователей Квизов:

Перед отправкой данных, внесенных в Квиз, Пользователи Квизов предоставляют Оператору или Заказчику свое согласие на обработку своих данных. Данное согласие является самостоятельным законным основанием для обработки данных Пользователей Квизов.

Пользователи Квизов предоставляют свое согласие на обработку данных путем заполнения на Сайте Заказчика специальной формы о предоставлении согласия (чек-бокс).

4.2.3. Отзыв согласия:

Вы можете отозвать свое согласие в любое время, заполнив форму отзыва согласия, размещенную по следующей ссылке – https://mrqz.me/Privacy_Policy

Отзыв согласия не повлияет на законность обработки, основанной на ранее выданном согласии.

В случае отзыва вашего согласия и при отсутствии иных законных оснований для обработки данных все ваши данные будут уничтожены, что сделает невозможным использование Сервиса «Паттайя Град».

4.3. Законные интересы

Оператор обрабатывает данные для:

проведения аналитических, маркетинговых, статистических и иных исследований использования Сервиса для оптимизации его работы, исправления ошибок и сбоев в работе Сервиса, развития продуктов и услуг Оператора и его партнеров;
защиты собственных законных интересов, например, для обеспечения возможности судебной защиты.

5. ПЕРЕДАЧА ДАННЫХ ТРЕТЬИМ ЛИЦАМ
5.1. Оператор может предоставлять ваши данные третьим лицам в случаях:

если Оператор обязан сделать это по закону, в связи с проведением судебных разбирательств, административных процедур либо для установления, осуществления или защиты законных прав Оператора;
если Пользователи Квизов предоставляют свои данные через Квиз и дали согласие на обработку своих данных;
если Оператор действует на основании поручения Заказчика на обработку персональных данных Пользователей Квиза;
если Оператор пользуется услугами сторонних дата-центров для обеспечения хранения и защиты обрабатываемых данных;
если обработка данных будет поручена третьим лицам (например, операторам сервисов e-mail / sms маркетинга, операторам аналитических сервисов).
Оператор не будет передавать ваши данные третьим лицам, если это прямо не предусмотрено в настоящей Политике конфиденциальности, в Пользовательском соглашении или в согласии на обработку данных.

5.2. Передача данных Пользователей Квизов на основании согласия на обработку персональных данных.

В случаях, когда Пользователи Квизов при заполнении Квизов предоставляют Оператору свои данные и согласие на обработку этих данных, такие данные будут предоставлены Заказчикам, создавшим Квизы, В том числе Оператор может передавать следующие данные:

любые данные Пользователей Квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные, за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости; данных о банковских картах и иных платежных средствах.
Заказчикам запрещается создавать Квизы для сбора биометрических и специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни) без получения письменных согласий Пользователей на обработку персональных данных.

Мы не рекомендуем Пользователям Квизов предоставлять такие данные через Квизы без выдачи письменных согласий на обработку данных.

В случае же предоставления биометрических и специальных персональных данных без письменных согласий, Пользователи Квизов должны сообщить об этом Оператору для уничтожения таких данных либо оформления письменных согласий (по выбору Пользователя Квиза).

5.3. Передача данных Пользователей Квизов на основании поручения на обработку персональных данных

В случаях, когда Оператор обрабатывает данные Пользователей Квизов (предоставляемых при заполнении Квизов) на основании поручения на обработку персональных данных от Заказчика, такие данные будут предоставлены Заказчикам, которые создали Формы сбора данных или дали Оператору поручения на обработку. В том числе Оператор может передавать следующие данные:

любые данные Пользователей квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные, за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости; данных о банковских картах и иных платежных средствах.
Заказчикам запрещается создавать Квизы для сбора биометрических и специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни) без получения письменных согласий Пользователей на обработку персональных данных.

Мы не рекомендуем Пользователям Квизов предоставлять такие данные через Квизы без выдачи письменных согласий на обработку данных.

В случае же предоставления биометрических и специальных персональных данных без письменных согласий, Пользователи Квизов должны сообщить об этом Оператору для уничтожения таких данных либо оформления письменных согласий (по выбору Пользователя Квиза).

5.4. Передача данных операторам сервисов e-mail – маркетинга

В целях направления Заказчикам информационных сообщений о работе Сервиса Оператор может направить часть данных Заказчиков оператору сервиса e-mail - маркетинга, оказывающего соответствующие услуги Оператору. В том числе Оператор может передавать следующие данные:

фамилия, имя;
адрес электронной почты.
Без направления этих данных оператору сервиса e-mail - маркетинга получение вами информационных сообщений о работе Сервиса может быть невозможно.

5.5. Передача данных операторам аналитических сервисов

В случае если вы не заблокируете использование Сервисом файлов “cookie” и аналогичных технологий, эти данные (без предоставления иных персональных данных) будут в автоматическом режиме будут обрабатываться оператором аналитического сервиса, оказывающего нам соответствующие услуги (например, Яндекс.Метрика). В том числе могут обрабатываться следующие данные:

IP-адрес;
файлы “cookies” и аналогичные технологии;
данные об использовании пользователем Сервиса;
информация о местоположении подключения к Сервису.
5.6. Передача данных дата-центрам

Для обеспечения хранения и защиты обрабатываемых данных Оператор может использовать сторонние дата-центры. Сторонние дата-центры могут обрабатывать следующие данные:

данные Заказчиков: имя; адрес электронной почты; номер телефона; Telegram ID; должность;
данные Пользователей квизов: любые данные Пользователей квизов, собираемые Заказчиком посредством Квизов, в том числе могут быть: фамилия, имя, отчество; пол; возраст; дата рождения; место рождения; гражданство; адрес проживания; адрес электронной почты; номер телефона; ID в соцсетях; сведения о доходе; потребительские предпочтения и другие данные, за исключением: биометрических персональных данных; специальных персональных данных (данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, состояния здоровья, интимной жизни); сведений о судимости; данных о банковских картах и иных платежных средствах
Без направления этих данных в дата-центр работа Сервиса может быть невозможна.

6. ПРАВА СУБЪЕКТА ПЕРСОНАЛЬНЫХ ДАННЫХ
Для того, чтобы контролировать обработку своих данных, вы можете реализовывать определенные права. В частности, вы имеете право:

Получить доступ к вашим данным. Вы имеете право на получение информации, в том числе: подтверждение обработки ваших данных; информацию о правовых основаниях, целях, способах и сроках обработки данных; об операторе, обрабатывающем данные; сведения о лицах, которые имеют доступ к персональным данным или которым могут быть раскрыты данные; обрабатываемые данные и источник их получения; порядок осуществления прав владельца (субъекта) данных; сведения о лице, осуществляющем обработку данных по поручению оператора (если обработка была поручена); иные сведения.
Требовать исправления (уточнения) данных. Если вы обнаружите, что Оператор обрабатывает неточные или устаревшие данные, вы можете проверить их точность и / или попросить обновить или исправить их.
Ограничить (блокировать) обработку ваших данных. Если вы оспариваете точность своих данных, полагаете, что Оператор обрабатывает их незаконно или хотите возразить против обработки, вы имеете право временно остановить обработку ваших данных, чтобы проверить, была ли обработка корректной. В этом случае Оператор не будет обрабатывать данные для каких-либо целей, кроме их хранения, до тех пор, пока не исчезнут причины введения ограничения.
Требовать уничтожения ваших данных. Если Оператор не обязан хранить данные в соответствии с законодательством, данные будут уничтожены по вашему запросу.
Чтобы воспользоваться своими правами, вы можете направить свой запрос на электронную почту Оператора: privacy@marquiz.io.

7. БЕЗОПАСНОСТЬ ДАННЫХ
Оператор принимает необходимые и достаточные меры для защиты вашей информации и данных от несанкционированного или случайного доступа, уничтожения, изменения, блокировки, копирования, распространения, а также от других незаконных действий.

Оператор предоставляет доступ к вашим данным только уполномоченным лицам. Такие лица соблюдают строгую конфиденциальность и предотвращают несанкционированный доступ к вашим данным.

Оператор несёт ответственность за конфиденциальность обрабатываемых данных в той части, в которой Оператор имеет непосредственную возможность для обеспечения безопасности обработки данных и осуществления контроля обработки данных.

Ответственность за конфиденциальность обрабатываемых данных, передаваемых третьим лицам (например, данных Пользователей Квизов, передаваемых Заказчикам) несут непосредственно третьи лица, получившие такие данные.

8. ОБНОВЛЕНИЕ НАСТОЯЩЕЙ ПОЛИТИКИ
Оператор может обновлять настоящую Политику конфиденциальности. Новые версии Политики конфиденциальности будут публиковаться в Сервисе на сайте в сети Интернет «https://www.marquiz.ru/».

Изменения в Политику конфиденциальности вступают в силу с момента публикации обновленной версии Политики конфиденциальности.

Рекомендуем вам при каждом посещении сайта «Паттайя Град» проверять страницу Политики конфиденциальности, чтобы убедиться, что вас устраивает ее действующая вот такой текст.
`;

export const privacyPolicyVersion = 'Версия: 20.02.2025 г.';
export const privacyPolicyParagraphs = privacyPolicyContent
	.trim()
	.split(/\n\n+/)
	.map((paragraph) => paragraph.trim())
	.filter(Boolean);
